---
title: CuttingFailures
classe: Autodesk.Revit.DB.BuiltInFailures+CuttingFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# CuttingFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotCopyFromMultipleLinks { get; }` | `CuttingFailures.CannotCopyFromMultipleLinks` | FailureDefinitionId |
| `FailureDefinitionId ElementsWithNotCopiedParentsDeleted { get; }` | `CuttingFailures.ElementsWithNotCopiedParentsDeleted` | FailureDefinitionId |
| `FailureDefinitionId NoFileSaved { get; }` | `CuttingFailures.NoFileSaved` | FailureDefinitionId |
| `FailureDefinitionId NoSupported2DElementsToCopyFromView { get; }` | `CuttingFailures.NoSupported2DElementsToCopyFromView` | FailureDefinitionId |
| `FailureDefinitionId UnableToCopyElementsFromFile { get; }` | `CuttingFailures.UnableToCopyElementsFromFile` | FailureDefinitionId |
| `FailureDefinitionId UnableToPasteToFile { get; }` | `CuttingFailures.UnableToPasteToFile` | FailureDefinitionId |
| `FailureDefinitionId UnableToReplaceWithLink { get; }` | `CuttingFailures.UnableToReplaceWithLink` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```